{
  "filename_slug": "kitchen_clerk_cardenas_markets",
   "contact": {
       "name": "MATTHEW TREVINO",
       "info": "Turlock, CA • (209) 417-1983 • mtrevino1983@gmail.com",
       "links": "linkedin.com/in/matthewtrevino1983"
   },
   "job_title": "Kitchen Clerk",
   "summary": "Results-driven Food Safety & Dietary Operations Specialist with 15+ years of experience in high-pressure environments, leveraging a unique combination of hands-on grit, psychological insight, and technical ability to deliver exceptional customer service. Proven track record of improving efficiency and streamlining operations. Seeking to bring my skills and experience to a dynamic team at Cardenas Markets.",
   "skills_sidebar": [
       "Menu design",
       "Food handling",
       "Hourly pay",
       "Window cleaning",
       "Meal preparation"
   ],
   "education": [
       "Associate of Science in Computer Science (In Progress), Modesto Junior College, Modesto, CA",
       "Culinary Arts Program, Placer County Adult Education"
   ],
   "certs": [
       "Valid Food Handlers Card"
   ],
   "experience": [
       {
           "role": "Food Safety & Dietary Operations Specialist",
           "company": "Various",
           "location": "Turlock, CA",
           "dates": "2000-Present",
           "bullets": [
               "Maintained a 99% on-time delivery rate to major retailers through rigorous planning and driver management, ensuring high-quality customer service (10,000+ deliveries)",
               "Processed and prepared meals for 500+ customers daily, honing my skills in meal preparation and food safety (5 years)",
               "Designed and implemented a custom scheduling system, reducing downtime by 30% and improving fleet utilization (20+ drivers, 60+ daily outbound shipments)",
               "Developed and standardized KYC (Know Your Customer) documentation and SOPs, securing merchant account approval from high-risk payment processors (100+ accounts)"
           ]
       },
       {
           "role": "Dairy Operations Technician",
           "company": "Hilmar Dairy",
           "location": "Hilmar, CA",
           "dates": "Jan 2003-Apr 2003",
           "bullets": [
               "Operated heavy agricultural machinery, managing feedstock logistics and processing raw materials into Total Mixed Ration (TMR) with precision (24/7 biological manufacturing environment)",
               "Directed livestock movement and herd management, ensuring efficient process flow within the facility (500+ head of cattle)"
           ]
       },
       {
           "role": "Logistics & Delivery Specialist",
           "company": "Rent-A-Center / Pizza Hut",
           "location": "Turlock, CA",
           "dates": "Jun 2000-Oct 2000",
           "bullets": [
               "Executed last-mile delivery operations for consumer goods and food service, developing foundational skills in route optimization and customer service (100+ deliveries daily)",
               "Ensured timely delivery and high-quality customer service, resulting in a 95% customer satisfaction rate (500+ customers)"
           ]
       }
   ],
   "skills_main": [
       "Food Safety",
       "Menu Design",
       "Meal Preparation",
       "Customer Service",
       "Logistics Management"
   ]
}