{
  "filename_slug": "line_cook",
   "contact": {
       "name": "MATTHEW TREVINO",
       "info": "Turlock, CA • (209) 417-1983 • mtrevino1983@gmail.com",
       "links": "linkedin.com/in/matthewtrevino1983 • github.com/m5trevino"
   },
   "job_title": "Line Cook",
   "summary": "Results-driven culinary professional leveraging experience in logistics management and IT automation to drive efficiency in kitchen operations. Proven track record of streamlining processes and improving productivity. Skilled in menu design, food handling, and meal preparation with a strong focus on quality and customer satisfaction.",
   "skills_sidebar": [
       "Menu Design",
       "Food Handling",
       "Meal Preparation",
       "Kitchen Operations",
       "Quality Control",
       "Customer Service",
       "Logistics Management",
       "IT Automation",
       "Process Improvement",
       "Productivity Enhancement"
   ],
   "education": [
       "Associate of Science in Computer Science (In Progress), Modesto Junior College, Modesto, CA",
       "Culinary Arts Program, Placer County Adult Education"
   ],
   "certs": [
       "Food Handler Certificate"
   ],
   "experience": [
       {
           "role": "Line Cook",
           "company": "Various",
           "location": "Turlock, CA",
           "dates": "2000-2004",
           "bullets": [
               "Prepared and cooked food items to ensure the highest quality of product and experience for every guest",
               "Assisted with keeping the kitchen organized and running efficiently",
               "Ensured and monitored proper food handling, portion size, sanitation, and food storage procedures",
               "Managed multiple orders and ensured food was prepared and delivered promptly and in acceptable quantities and quality",
               "Maintained a high level of health and safety standards for the kitchen and workstations"
           ]
       },
       {
           "role": "Transportation Coordinator / Logistics Architect",
           "company": "Van Groningen & Sons, Inc.",
           "location": "Manteca, CA",
           "dates": "2015-2022",
           "bullets": [
               "Orchestrated logistics for a high-volume agricultural shipper, managing a fleet of 20+ drivers and 60+ daily outbound shipments",
               "Identified systemic bottlenecks in the manual scheduling process and designed and implemented a custom scheduling system",
               "Maintained 99% on-time delivery rate to major retailers through rigorous planning and driver management"
           ]
       }
   ],
   "skills_main": [
       "Menu Design",
       "Food Handling",
       "Meal Preparation",
       "Kitchen Operations",
       "Quality Control",
       "Customer Service",
       "Logistics Management",
       "IT Automation",
       "Process Improvement",
       "Productivity Enhancement"
   ]
}