{
  "key": "9f1819155bc194d4",
  "url": "https://www.indeed.com/viewjob?jk=9f1819155bc194d4",
  "title": "Apartment Manager - Overland Court (PART-TIME)",
  "jobUrl": "http://www.indeed.com/job/apartment-manager-overland-court-part-time-9f1819155bc194d4",
  "refNum": "f06448d9-0fb3-4991-a0c5-f900eff21d58",
  "datePublished": "2025-11-25T18:47:44.280Z",
  "dateOnIndeed": "2025-11-25T18:47:44.280Z",
  "expired": false,
  "expirationDate": null,
  "isRepost": null,
  "isLatestPost": null,
  "isPlacement": null,
  "isUrgentHire": false,
  "isHighVolumeHiring": false,
  "language": "en",
  "location": {
    "countryName": "United States",
    "countryCode": "US",
    "admin1Code": "CA",
    "admin2Code": "047",
    "admin3Code": null,
    "admin4Code": null,
    "city": "Los Banos",
    "postalCode": "93635",
    "streetAddress": null,
    "latitude": 37.052174,
    "longitude": -120.85159
  },
  "employer": {
    "name": "Buckingham Property Management",
    "companyPageUrl": "https://www.indeed.com/cmp/Buckingham-Property-Management",
    "briefDescription": "",
    "address": "Fresno",
    "industry": "Iv1_REAL_ESTATE",
    "employeesCount": "201 to 500",
    "revenue": "$5M to $25M (USD)",
    "ceoName": "",
    "ceoPhotoUrl": "",
    "corporateWebsite": "https://www.buckinghampm.com",
    "logoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/7b791f8e86e321d9b277c80f8fd7ae57",
    "headerImageUrl": "",
    "ratingsCount": 62,
    "ratingsValue": 2.4
  },
  "parentEmployer": {
    "name": "",
    "companyPageUrl": ""
  },
  "attributes": {
    "2W3B3": "Background check",
    "44AQZ": "Spanish",
    "4F83K": "Website management",
    "5RZJQ": "Report writing",
    "69UNZ": "Property management tools",
    "6CTRS": "Microsoft Outlook",
    "728G9": "Operations management",
    "75GKK": "Part-time",
    "7SBGS": "Removing debris",
    "7SRRR": "Weekends as needed",
    "8AD9K": "Hourly pay",
    "8E8TT": "Urgently hiring",
    "8GBMM": "Vendor management",
    "8S5AX": "Phone communication",
    "8WW4H": "Safety inspections for hazard identification",
    "A7SFW": "Writing skills",
    "AWTD9": "Greeting customers",
    "AYNP8": "Regulatory compliance",
    "B47F2": "Email",
    "B49ZT": "Property showing",
    "BAUUB": "Yardi",
    "BRPUD": "Zoom",
    "C35T3": "Compliance audits & assessments",
    "CCP3M": "Filing",
    "CCRSS": "Maintenance work",
    "CF6RF": "ADP",
    "D866K": "English",
    "DN563": "Mid-level",
    "E6QUH": "Groundskeeping",
    "E9JQ5": "Microsoft Office",
    "EMGHB": "Evenings as needed",
    "FCDZ7": "Administrative experience",
    "G2HXN": "Social media platforms",
    "GH7J6": "Driver's License",
    "H6N7V": "Lease or rental agreement management",
    "JE22R": "Driving",
    "JQHA5": "Criminal background check",
    "KJQ9Q": "Travel",
    "MEYBU": "Apartments",
    "MYXED": "Vendor relationship management",
    "Q2S5B": "Newsletters (communication methods)",
    "S5T66": "Deposits",
    "S8JFX": "Maintenance management",
    "SWG7T": "In-person",
    "T9FF9": "Clean workspace maintenance",
    "TB7GN": "Facility security systems",
    "TQ3BF": "Reliable transportation",
    "X9ASE": "Multifamily properties",
    "XA6MB": "Marketing",
    "Y33HD": "Regulatory compliance management",
    "Y7N56": "Tenants",
    "Z6QHZ": "Customer complaint resolution",
    "ZGCT3": "Client interaction via phone calls"
  },
  "employerAttributes": {
    "2W3B3": "Background check",
    "75GKK": "Part-time",
    "BAUUB": "Yardi",
    "D866K": "English",
    "E9JQ5": "Microsoft Office",
    "GH7J6": "Driver's License"
  },
  "jobTypes": {
    "75GKK": "Part-time"
  },
  "benefits": {},
  "socialInsurance": {},
  "occupations": {
    "MGTWW": "Administrative & Business Operations Occupations",
    "WKJ5E": "Property Leasing & Management Occupations"
  },
  "baseSalary": {
    "min": "",
    "max": "",
    "unitOfWork": "HOUR",
    "currencyCode": "USD"
  },
  "description": {
    "text": "Buckingham Property Management has an immediate opening for an experienced *PART-TIME Apartment Manager* involving oversight of the daily operations of a multi-resident Affordable Housing apartment complex at its *Overland Court property in Los Banos, California!*\n\n*This position does not provide housing as a condition of employment*.\n\nThe selected individual will have *at least one (1) year of management experience;* specifically in in the management of a large apartment complex, *preferred*.\n\nYou will be self-driven with great follow through. You are a team player, dependable and will always provide outstanding customer service to residents and fellow employees. You will have strong problem-solving skills with an ability to independently address issues and resolve disputes, and act independently in face-to-face situations using judgment, tact, and discretion. You will have an ability to read and interpret rental agreements, government regulations and budgets.\n\nYou will have an ability to prepare effective business correspondence and effectively communicate in English with groups and/or individuals, and/or have an ability to speak and understand Spanish as required by property demographics. You will value and exhibit effective and courteous partnerships with co-workers (whether assigned to the same property or assisting from another property) by maintaining professional standards of conduct at all times.\n\nYou will act as a *partner* with the Maintenance Technician and/or Maintenance Lead (if assigned) under the direction of the Regional Director in ensuring superior curb-appeal, timely and quality unit turns and overall maintenance of our complex at all times.\n\n*While other duties may be added, the Essential Duties and Responsibilities of the position include:*\n\n* Adheres to established work schedule and property schedule, including but not limited to, daily Zoom meeting, daily property walk-through with Maintenance Technician and/or Maintenance Lead (if assigned) to maximize curb appeal, overall community appearance, and preservation of client asset; reports issues immediately and makes recommendations for improvement to Regional Director and/or Director of Property Management.\n* Responds to after-hours emergency situations at the property, as directed by the Regional Director and/or Director of Property Management.\n* Ensures with Regional Director as to status of priorities at property and all issues that may need support either via email or via the daily Zoom meeting;\n* Physically walks the property with the Maintenance Technician and/or Maintenance Lead (if assigned) on a basis to maximize curb appeal and overall community appearance by collaborating with the Maintenance Technician and/or Maintenance Lead (if assigned) on necessary cleaning; litter, debris, cigarette butt and pet dropping removal from the grounds particularly ensuring that the following areas are neat and clean at all times: community office, pool area, laundry rooms, stairways and breezeways, dumpster areas, recreation areas, grounds adjacent to the road and in front of the community office, walkways to and from, and in-between buildings, parking lots and drives.\n* Markets and leases the community in accordance with BPM marketing strategies; responsible and accountable for managing unit vacancies.\n* Reviews applications of potential residents; applies established criteria for resident qualification including, but not limited to, income and occupancy guidelines.\n* Submits required paperwork to Compliance Department for review and approval.\n* Shows vacant units to qualitied resident candidates.\n* Prepares new resident paperwork upon initial occupancy and annually thereafter, if necessary.\n* Hold residents accountable for timely rent payments and paperwork compliance; follows up on delinquent rental payments; prepares notices.\n* Collects rents and makes deposits on a daily basis.\n* Prepares resident lease terminations paperwork for Regional Director review and approval.\n* Communicates all community procedures and policies to residents; enforces compliance.\n* Conducts intake of resident complaints escalating to the Regional Director and/or Director of Property Management for determination of the correct course of action.\n* Prepares for and participates in regulatory audits and/or inspection.\n* Performs and/or participates in monthly, quarterly and annual inspections of units, buildings, and/or common areas, as required.\n* Receives service requests from residents, records and determines priority of response, and routes to the Maintenance Technician, Maintenance Lead and/or vendor (as appropriate).\n* Partners with Maintenance Technician, Maintenance Lead and/or vendor (as appropriate) in the scheduling/completion of unit turns to ensure units are “rent ready” within 7-10 days of move-out; communicates obstacles affecting timely completion of turns to Regional Director in a timely manner.\n* Coordinates special maintenance work by advising residents when work is scheduled.\n* Oversees proper use of and maintains community room, laundry room, office and other common areas.\n* Ensures corporate office provides/receives necessary paperwork for processing of invoices.\n* Interacts regularly with third-party vendors/contractors.\n* Participates in quarterly safety inspections, and as needed;\n* Prepares daily, weekly, monthly, quarterly and annual reports, as required.\n* Assists with monthly newsletter by writing and typing articles (property specific).\n* Answers phone, greets visitors, and channels inquiries to appropriate Buckingham personnel; personally handles any service-related calls.\n* Performs general administrative duties such as logging rents, filing, typing, mailing, and ordering supplies.\n* Ensures security of property assets, including but not limited to: office, laundry room, pool, community room and buildings by setting appropriate alarm systems and/or setting appropriate locks.\n\n*COMPUTER HARDWARE AND SOFTWARE APPLICATIONS, EQUIPMENT, MACHINERY, OR TOOLS A PERSON IN THIS JOB MUST USE IN THE PERFORMANCE OF THE JOB DUTIES:*\n\n* Desktop computer, printer, scanner, copier, office telephone, Company-provided cell phone\n* *SOFTWARE*: Microsoft Office Suite (Word, Excel, Outlook, Publisher)\n* *SOFTWARE*: YARDI\n* *SOFTWARE*: ADP Automated Timekeeping\n* Social Media for marketing purposes only in accordance with company policy\n* Basic website administration\n* Online postings\n\n*BUSINESS TRAVEL REQUIREMENTS*\n\nBPM reasonably expects driving to be one of the job functions for this position, therefore, qualified applicants must have reliable transportation for business travel purposes.\n\n* Travel requirements are of a local nature (within 100 miles) up to ¼ of time.\n* Employees are reimbursed for the approved use of their personal automobile on official Buckingham business.\n* Employee who are required to use their personal automobiles for business travel *must provide evidence of liability insurance coverage as well as evidence of and maintenance of a valid driver’s license* upon hire and in accordance with Buckingham policy.\n\n*SCHEDULE AND COMPENSATION*\n\nWhile the typical schedule for a person in this position is *24 hours per week* (Monday, Wednesday, and Friday: 8-5 p.m. with a one-hour lunch generally between 12-1 p.m.) , additional hours may be available and/or necessary on holidays and during evenings and/or weekends, according to the needs of the business.\n\nCompensation for this *PART-TIME*, hourly non-exempt position is *$22.00 - $22.00 per hour*.\n\n*TO APPLY FOR THIS POSITION*, submit an Employment Application to careers@buckinghampm.com. _Picture files will not be accepted so please ensure that application materials are submitted as PDF files._\n\nWhile resumes and cover letters may be submitted, as well, all applicants are required to submit an Employment Application. *NO PHONE CALLS PLEASE.*\n\n_All employment offers are “conditional” upon successful completion of all pre-employment requirements including, but not limited to, post-offer/pre-employment criminal background check, credit report (permissible under California Labor Code section 1024.5 if you are applying for or work in a position that affords regular access to bank or credit card account information, Social Security numbers, and dates of birth), verification of previous employment, motor vehicle report (if applicable to the position), and/or reference checks._\n\n_Unless or until an offer of employment has no contingencies or conditions, you should not take any action that could result in financial loss if a conditional offer is withdrawn, such as giving notice of intent to terminate your current employment, selling real estate, or incurring any other costs associated with accepting employment with Buckingham Property Management. No such activity should be undertaken until after you have been informed by Buckingham Property Management that an employment offer is no longer conditional._\n\n_Buckingham Property Management will consider qualified applicants for employment who have criminal histories in a manner consistent with applicable laws._\n\n_Buckingham Property Management will provide reasonable accommodation to any applicant who needs assistance in completing our employment application. If you need an accommodation due to a disability, please contact us about your interest in employment at _careers@buckinghampm.com_. Alternatively, you can call us at (559) 801-0730. NOTE: This email address and phone number is not for general employment inquiries._\n\n_Buckingham Property Management’s policy is to fill every position without regard to _race (including hair texture and protective hairstyles), color, national origin (including language use restrictions and possession of a driver's license issued to persons unable to prove their presence in the United States is authorized under federal law), ancestry, religion (including religious dress and grooming practices), sex/gender (including pregnancy, childbirth, breastfeeding or related medical conditions), sex stereotype, gender identity/gender expression/transgender (including whether or not you are transitioning or have transitioned) and sexual orientation, reproductive health decision-making, physical or mental disability, medical condition, genetic information/characteristics, marital status/registered domestic partner status, age (40 and over), military or veteran status, use of cannabis/marijuana off the job and away from the workplace; and or any other basis protected by federal, state or local law or ordinance or regulation.\n\n_Buckingham Property Management maintains a Drug-Free Workplace._\n\n_*BUCKINGHAM PROPERTY MANAGEMENT IS FULLY COMMITTED TO FRAUD PREVENTION AND DETECTION*_ _and therefore relies upon the employees it hires in following through on that commitment._\n\n_\\*This Job Posting does not necessarily represent an exhaustive list of all responsibilities, skills, duties, requirements, or competencies associated with this job. While this Job Posting is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change without formal revision of the Job Posting. This Job Posting replaces all previous Job Postings for this position._\n\n_Buckingham Property Management reserves the right, at any time, with or without notice, to alter or change job responsibilities and/or work schedules, reassign or transfer job positions, or assign additional job responsibilities based upon the needs of the Company. _\n\nJob Type: Part-time\n\nPay: $22.00 per hour\n\nWork Location: In person",
    "html": "<p>Buckingham Property Management has an immediate opening for an experienced <b>PART-TIME Apartment Manager</b> involving oversight of the daily operations of a multi-resident Affordable Housing apartment complex at its <b>Overland Court property in Los Banos, California!</b></p><p><b>This position does not provide housing as a condition of employment</b>.</p><p>The selected individual will have <b>at least one (1) year of management experience;</b> specifically in in the management of a large apartment complex, <b>preferred</b>.</p><p>You will be self-driven with great follow through. You are a team player, dependable and will always provide outstanding customer service to residents and fellow employees. You will have strong problem-solving skills with an ability to independently address issues and resolve disputes, and act independently in face-to-face situations using judgment, tact, and discretion. You will have an ability to read and interpret rental agreements, government regulations and budgets.</p><p>You will have an ability to prepare effective business correspondence and effectively communicate in English with groups and/or individuals, and/or have an ability to speak and understand Spanish as required by property demographics. You will value and exhibit effective and courteous partnerships with co-workers (whether assigned to the same property or assisting from another property) by maintaining professional standards of conduct at all times.</p><p>You will act as a <b>partner</b> with the Maintenance Technician and/or Maintenance Lead (if assigned) under the direction of the Regional Director in ensuring superior curb-appeal, timely and quality unit turns and overall maintenance of our complex at all times.</p><p><b>While other duties may be added, the Essential Duties and Responsibilities of the position include:</b></p><ul><li>Adheres to established work schedule and property schedule, including but not limited to, daily Zoom meeting, daily property walk-through with Maintenance Technician and/or Maintenance Lead (if assigned) to maximize curb appeal, overall community appearance, and preservation of client asset; reports issues immediately and makes recommendations for improvement to Regional Director and/or Director of Property Management.</li><li>Responds to after-hours emergency situations at the property, as directed by the Regional Director and/or Director of Property Management.</li><li>Ensures with Regional Director as to status of priorities at property and all issues that may need support either via email or via the daily Zoom meeting;</li><li>Physically walks the property with the Maintenance Technician and/or Maintenance Lead (if assigned) on a basis to maximize curb appeal and overall community appearance by collaborating with the Maintenance Technician and/or Maintenance Lead (if assigned) on necessary cleaning; litter, debris, cigarette butt and pet dropping removal from the grounds particularly ensuring that the following areas are neat and clean at all times: community office, pool area, laundry rooms, stairways and breezeways, dumpster areas, recreation areas, grounds adjacent to the road and in front of the community office, walkways to and from, and in-between buildings, parking lots and drives.</li><li>Markets and leases the community in accordance with BPM marketing strategies; responsible and accountable for managing unit vacancies.</li><li>Reviews applications of potential residents; applies established criteria for resident qualification including, but not limited to, income and occupancy guidelines.</li><li>Submits required paperwork to Compliance Department for review and approval.</li><li>Shows vacant units to qualitied resident candidates.</li><li>Prepares new resident paperwork upon initial occupancy and annually thereafter, if necessary.</li><li>Hold residents accountable for timely rent payments and paperwork compliance; follows up on delinquent rental payments; prepares notices.</li><li>Collects rents and makes deposits on a daily basis.</li><li>Prepares resident lease terminations paperwork for Regional Director review and approval.</li><li>Communicates all community procedures and policies to residents; enforces compliance.</li><li>Conducts intake of resident complaints escalating to the Regional Director and/or Director of Property Management for determination of the correct course of action.</li><li>Prepares for and participates in regulatory audits and/or inspection.</li><li>Performs and/or participates in monthly, quarterly and annual inspections of units, buildings, and/or common areas, as required.</li><li>Receives service requests from residents, records and determines priority of response, and routes to the Maintenance Technician, Maintenance Lead and/or vendor (as appropriate).</li><li>Partners with Maintenance Technician, Maintenance Lead and/or vendor (as appropriate) in the scheduling/completion of unit turns to ensure units are &ldquo;rent ready&rdquo; within 7-10 days of move-out; communicates obstacles affecting timely completion of turns to Regional Director in a timely manner.</li><li>Coordinates special maintenance work by advising residents when work is scheduled.</li><li>Oversees proper use of and maintains community room, laundry room, office and other common areas.</li><li>Ensures corporate office provides/receives necessary paperwork for processing of invoices.</li><li>Interacts regularly with third-party vendors/contractors.</li><li>Participates in quarterly safety inspections, and as needed;</li><li>Prepares daily, weekly, monthly, quarterly and annual reports, as required.</li><li>Assists with monthly newsletter by writing and typing articles (property specific).</li><li>Answers phone, greets visitors, and channels inquiries to appropriate Buckingham personnel; personally handles any service-related calls.</li><li>Performs general administrative duties such as logging rents, filing, typing, mailing, and ordering supplies.</li><li>Ensures security of property assets, including but not limited to: office, laundry room, pool, community room and buildings by setting appropriate alarm systems and/or setting appropriate locks.</li></ul><p><b>COMPUTER HARDWARE AND SOFTWARE APPLICATIONS, EQUIPMENT, MACHINERY, OR TOOLS A PERSON IN THIS JOB MUST USE IN THE PERFORMANCE OF THE JOB DUTIES:</b></p><ul><li>Desktop computer, printer, scanner, copier, office telephone, Company-provided cell phone</li><li><b>SOFTWARE</b>: Microsoft Office Suite (Word, Excel, Outlook, Publisher)</li><li><b>SOFTWARE</b>: YARDI</li><li><b>SOFTWARE</b>: ADP Automated Timekeeping</li><li>Social Media for marketing purposes only in accordance with company policy</li><li>Basic website administration</li><li>Online postings</li></ul><p><b>BUSINESS TRAVEL REQUIREMENTS</b></p><p>BPM reasonably expects driving to be one of the job functions for this position, therefore, qualified applicants must have reliable transportation for business travel purposes.</p><ul><li>Travel requirements are of a local nature (within 100 miles) up to &frac14; of time.</li><li>Employees are reimbursed for the approved use of their personal automobile on official Buckingham business.</li><li>Employee who are required to use their personal automobiles for business travel <b>must provide evidence of liability insurance coverage as well as evidence of and maintenance of a valid driver&rsquo;s license</b> upon hire and in accordance with Buckingham policy.</li></ul><p><b>SCHEDULE AND COMPENSATION</b></p><p>While the typical schedule for a person in this position is <b>24 hours per week</b> (Monday, Wednesday, and Friday: 8-5 p.m. with a one-hour lunch generally between 12-1 p.m.) , additional hours may be available and/or necessary on holidays and during evenings and/or weekends, according to the needs of the business.</p><p>Compensation for this <b>PART-TIME</b>, hourly non-exempt position is <b>$22.00 - $22.00 per hour</b>.</p><p><b>TO APPLY FOR THIS POSITION</b>, submit an Employment Application to careers@buckinghampm.com. <i>Picture files will not be accepted so please ensure that application materials are submitted as PDF files.</i></p><p>While resumes and cover letters may be submitted, as well, all applicants are required to submit an Employment Application. <b>NO PHONE CALLS PLEASE.</b></p><p><i>All employment offers are &ldquo;conditional&rdquo; upon successful completion of all pre-employment requirements including, but not limited to, post-offer/pre-employment criminal background check, credit report (permissible under California Labor Code section 1024.5 if you are applying for or work in a position that affords regular access to bank or credit card account information, Social Security numbers, and dates of birth), verification of previous employment, motor vehicle report (if applicable to the position), and/or reference checks.</i></p><p><i>Unless or until an offer of employment has no contingencies or conditions, you should not take any action that could result in financial loss if a conditional offer is withdrawn, such as giving notice of intent to terminate your current employment, selling real estate, or incurring any other costs associated with accepting employment with Buckingham Property Management. No such activity should be undertaken until after you have been informed by Buckingham Property Management that an employment offer is no longer conditional.</i></p><p><i>Buckingham Property Management will consider qualified applicants for employment who have criminal histories in a manner consistent with applicable laws.</i></p><p><i>Buckingham Property Management will provide reasonable accommodation to any applicant who needs assistance in completing our employment application. If you need an accommodation due to a disability, please contact us about your interest in employment at </i>careers@buckinghampm.com<i>. Alternatively, you can call us at (559) 801-0730. NOTE: This email address and phone number is not for general employment inquiries.</i></p><p><i>Buckingham Property Management&rsquo;s policy is to fill every position without regard to </i>race (including hair texture and protective hairstyles), color, national origin (including language use restrictions and possession of a driver's license issued to persons unable to prove their presence in the United States is authorized under federal law), ancestry, religion (including religious dress and grooming practices), sex/gender (including pregnancy, childbirth, breastfeeding or related medical conditions), sex stereotype, gender identity/gender expression/transgender (including whether or not you are transitioning or have transitioned) and sexual orientation, reproductive health decision-making, physical or mental disability, medical condition, genetic information/characteristics, marital status/registered domestic partner status, age (40 and over), military or veteran status, use of cannabis/marijuana off the job and away from the workplace; and or any other basis protected by federal, state or local law or ordinance or regulation.</p><p><i>Buckingham Property Management maintains a Drug-Free Workplace.</i></p><p><i><b>BUCKINGHAM PROPERTY MANAGEMENT IS FULLY COMMITTED TO FRAUD PREVENTION AND DETECTION</b></i> <i>and therefore relies upon the employees it hires in following through on that commitment.</i></p><p><i>*This Job Posting does not necessarily represent an exhaustive list of all responsibilities, skills, duties, requirements, or competencies associated with this job. While this Job Posting is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change without formal revision of the Job Posting. This Job Posting replaces all previous Job Postings for this position.</i></p><p><i>Buckingham Property Management reserves the right, at any time, with or without notice, to alter or change job responsibilities and/or work schedules, reassign or transfer job positions, or assign additional job responsibilities based upon the needs of the Company. </i></p><p>Job Type: Part-time</p><p>Pay: $22.00 per hour</p><p>Work Location: In person</p>"
  }
}